tests/golden/complex_normal.mermaid
flowchart RL
    HEAD["HEAD"]
    refs_heads_develop["develop"]
    790db164f18098ef413853e56f7d93e70a2c187a["commit<br/>790db"]
    0b18da950bf84d50fbc7562a4747f13094fc85df["commit<br/>0b18d"]
    34f5775c53e87185c6f0c5342e74c9f9d9a06c40["b8e06 (2) 34f57"]
    de59f3a1667fc051ccc0b0682694585e36040bf4["commit<br/>de59f"]
    717b8ae6fe822a635bb36b718f6a7cb2a27863a5["commit<br/>717b8"]
    98c0271fb08e9ec656af44e1ce7e1f310d722f3b["commit<br/>98c02"]
    9d7c9410192654b9445d1935283210dbfa43d722["commit<br/>9d7c9"]
    8a510ae66f449135f143a5099d7f7c8755c8fe9a["commit<br/>8a510"]
    615f48cc20ab3061238d022c49147045241a004f["commit<br/>615f4"]
    d18f056029432df7a41eacf452447a111f0f4a12["commit<br/>d18f0"]
    refs_heads_feature_alpha["feature/alpha"]
    refs_heads_feature_beta["feature/beta"]
    eb852ccf183082960915022040318f9549283f89["commit<br/>eb852"]
    886fab2b89c493ab873baa91ecb1438da7321edc["commit<br/>886fa"]
    refs_heads_main["main"]
    refs_tags_v0_1["tag<br/>v0.1"]
    refs_tags_v1_0["tag<br/>v1.0"]
    68ab57a3957981ada1d7d99f5ed25152cf0c89d8["tag<br/>68ab5"]
    FETCH_HEAD["FETCH_HEAD"]
    ORIG_HEAD["ORIG_HEAD"]
    HEAD --> refs_heads_develop
    refs_heads_develop --> 790db164f18098ef413853e56f7d93e70a2c187a
    790db164f18098ef413853e56f7d93e70a2c187a --> 0b18da950bf84d50fbc7562a4747f13094fc85df
    0b18da950bf84d50fbc7562a4747f13094fc85df --> 34f5775c53e87185c6f0c5342e74c9f9d9a06c40
    34f5775c53e87185c6f0c5342e74c9f9d9a06c40 --> de59f3a1667fc051ccc0b0682694585e36040bf4
    de59f3a1667fc051ccc0b0682694585e36040bf4 --> 9d7c9410192654b9445d1935283210dbfa43d722
    de59f3a1667fc051ccc0b0682694585e36040bf4 --> 717b8ae6fe822a635bb36b718f6a7cb2a27863a5
    717b8ae6fe822a635bb36b718f6a7cb2a27863a5 --> 98c0271fb08e9ec656af44e1ce7e1f310d722f3b
    98c0271fb08e9ec656af44e1ce7e1f310d722f3b --> 9d7c9410192654b9445d1935283210dbfa43d722
    9d7c9410192654b9445d1935283210dbfa43d722 --> 8a510ae66f449135f143a5099d7f7c8755c8fe9a
    8a510ae66f449135f143a5099d7f7c8755c8fe9a --> 615f48cc20ab3061238d022c49147045241a004f
    615f48cc20ab3061238d022c49147045241a004f --> d18f056029432df7a41eacf452447a111f0f4a12
    refs_heads_feature_alpha --> 717b8ae6fe822a635bb36b718f6a7cb2a27863a5
    refs_heads_feature_beta --> eb852ccf183082960915022040318f9549283f89
    eb852ccf183082960915022040318f9549283f89 --> 886fab2b89c493ab873baa91ecb1438da7321edc
    886fab2b89c493ab873baa91ecb1438da7321edc --> 0b18da950bf84d50fbc7562a4747f13094fc85df
    refs_heads_main --> 8a510ae66f449135f143a5099d7f7c8755c8fe9a
    refs_tags_v0_1 --> d18f056029432df7a41eacf452447a111f0f4a12
    refs_tags_v1_0 --> 68ab57a3957981ada1d7d99f5ed25152cf0c89d8
    68ab57a3957981ada1d7d99f5ed25152cf0c89d8 --> de59f3a1667fc051ccc0b0682694585e36040bf4
    FETCH_HEAD --> d18f056029432df7a41eacf452447a111f0f4a12
    ORIG_HEAD --> 790db164f18098ef413853e56f7d93e70a2c187a
    style HEAD fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style refs_heads_develop fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style 790db164f18098ef413853e56f7d93e70a2c187a fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 0b18da950bf84d50fbc7562a4747f13094fc85df fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 34f5775c53e87185c6f0c5342e74c9f9d9a06c40 fill:#e5ffe5,stroke:#00ff00,stroke-width:2px
    style de59f3a1667fc051ccc0b0682694585e36040bf4 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 717b8ae6fe822a635bb36b718f6a7cb2a27863a5 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 98c0271fb08e9ec656af44e1ce7e1f310d722f3b fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 9d7c9410192654b9445d1935283210dbfa43d722 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 8a510ae66f449135f143a5099d7f7c8755c8fe9a fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 615f48cc20ab3061238d022c49147045241a004f fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style d18f056029432df7a41eacf452447a111f0f4a12 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style refs_heads_feature_alpha fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style refs_heads_feature_beta fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style eb852ccf183082960915022040318f9549283f89 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 886fab2b89c493ab873baa91ecb1438da7321edc fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style refs_heads_main fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style refs_tags_v0_1 fill:#fff6e5,stroke:#ffa900,stroke-width:2px
    style refs_tags_v1_0 fill:#fff6e5,stroke:#ffa900,stroke-width:2px
    style 68ab57a3957981ada1d7d99f5ed25152cf0c89d8 fill:#fff6e5,stroke:#ffa900,stroke-width:2px
    style FETCH_HEAD fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style ORIG_HEAD fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
